Returns all AreaReinforcement elements hosted by the referenced element.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public IList<AreaReinforcement> GetAreaReinforcementsInHost()
  Visual Basic
Public Function GetAreaReinforcementsInHost As IList(Of AreaReinforcement)
  Visual C++
public:
IList<AreaReinforcement^>^ GetAreaReinforcementsInHost()
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions DisabledDisciplineException   |   None of the following disciplines is enabled: Structural.
 See Also
  RebarHostData Class
  Autodesk.Revit.DB.Structure Namespace